src/test/resources/TestGetAvailabilitySoapMessage.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--

    Licensed to Jasig under one or more contributor license
    agreements. See the NOTICE file distributed with this work
    for additional information regarding copyright ownership.
    Jasig licenses this file to you under the Apache License,
    Version 2.0 (the "License"); you may not use this file
    except in compliance with the License. You may obtain a
    copy of the License at:

    http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing,
    software distributed under the License is distributed on
    an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
    KIND, either express or implied. See the License for the
    specific language governing permissions and limitations
    under the License.

-->

<!-- NOTE:  Can update by viewing SOAP message with debugger or enabling detailed logging when using EWS. -->

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<ns2:FindItem
			xmlns:ns2="http://schemas.microsoft.com/exchange/services/2006/messages"
			xmlns:ns3="http://schemas.microsoft.com/exchange/services/2006/types"
			Traversal="Shallow">
			<ns2:ItemShape>
				<ns3:BaseShape>AllProperties</ns3:BaseShape>
			</ns2:ItemShape>
			<ns2:ParentFolderIds>
				<ns3:DistinguishedFolderId Id="inbox" />
			</ns2:ParentFolderIds>
		</ns2:FindItem>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>